Revit 2024 API
FabricationVersionInfo Class
 The object contains versioning information about fabrication data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public class FabricationVersionInfo : IDisposable
Visual Basic
Public Class FabricationVersionInfo _
	Implements IDisposable
Visual C++
public ref class FabricationVersionInfo : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FabricationVersionInfo
See Also
FabricationVersionInfo Members
Autodesk.Revit.DB Namespace